In [1]:
import pandas as pd

In [3]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
         'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
         'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
         'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
         'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)

print(df)

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [5]:
df.groupby('Team')

In [6]:
df.groupby('Team').groups

{'Devils': Int64Index([2, 3], dtype='int64'),
 'Kings': Int64Index([4, 6, 7], dtype='int64'),
 'Riders': Int64Index([0, 1, 8, 11], dtype='int64'),
 'Royals': Int64Index([9, 10], dtype='int64'),
 'kings': Int64Index([5], dtype='int64')}

In [7]:
df.groupby(['Team','Year']).groups

{('Devils', 2014): Int64Index([2], dtype='int64'),
 ('Devils', 2015): Int64Index([3], dtype='int64'),
 ('Kings', 2014): Int64Index([4], dtype='int64'),
 ('Kings', 2016): Int64Index([6], dtype='int64'),
 ('Kings', 2017): Int64Index([7], dtype='int64'),
 ('Riders', 2014): Int64Index([0], dtype='int64'),
 ('Riders', 2015): Int64Index([1], dtype='int64'),
 ('Riders', 2016): Int64Index([8], dtype='int64'),
 ('Riders', 2017): Int64Index([11], dtype='int64'),
 ('Royals', 2014): Int64Index([9], dtype='int64'),
 ('Royals', 2015): Int64Index([10], dtype='int64'),
 ('kings', 2015): Int64Index([5], dtype='int64')}

In [37]:
grouped = df.groupby('Year')
for item in grouped:
    print("Type of elements of grouped:",type(item))
    print("Length of elements of grouped:",len(item))
    print("")
    print("Type of first entry:",type(item[0]))
    print("First entry:\n",item[0],"(This is the group name)")
    print("")
    print("Type of second entry:",type(item[1]))
    print("Second entry:\n",item[1])
    print("This is the partial df, restricted to the group")
    print("---------------------------------------------------------------\n")

Type of elements of grouped: <class 'tuple'>
Length of elements of grouped: 2

Type of first entry: <class 'int'>
First entry:
 2014 (This is the group name)

Type of second entry: <class 'pandas.core.frame.DataFrame'>
Second entry:
      Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701
This is the partial df, restricted to the group
---------------------------------------------------------------

Type of elements of grouped: <class 'tuple'>
Length of elements of grouped: 2

Type of first entry: <class 'int'>
First entry:
 2015 (This is the group name)

Type of second entry: <class 'pandas.core.frame.DataFrame'>
Second entry:
       Team  Rank  Year  Points
1   Riders     2  2015     789
3   Devils     3  2015     673
5    kings     4  2015     812
10  Royals     1  2015     804
This is the partial df, restricted to the group
---------------------------------------------------------------

Type of elements of grouped: <class 'tuple'>
Length of elements of grouped: 2

Type of first entry: <class 'int'>
First entry:
 2016 (This is the group name)

Type of second entry: <class 'pandas.core.frame.DataFrame'>
Second entry:
      Team  Rank  Year  Points
6   Kings     1  2016     756
8  Riders     2  2016     694
This is the partial df, restricted to the group
---------------------------------------------------------------

Type of elements of grouped: <class 'tuple'>
Length of elements of grouped: 2

Type of first entry: <class 'int'>
First entry:
 2017 (This is the group name)

Type of second entry: <class 'pandas.core.frame.DataFrame'>
Second entry:
       Team  Rank  Year  Points
7    Kings     1  2017     788
11  Riders     2  2017     690
This is the partial df, restricted to the group
---------------------------------------------------------------

In [40]:
grouped.groups # dict of groupnames and indices belonging to the group

groups: {2014: Int64Index([0, 2, 4, 9], dtype='int64'), 2015: Int64Index([1, 3, 5, 10], dtype='int64'), 2016: Int64Index([6, 8], dtype='int64'), 2017: Int64Index([7, 11], dtype='int64')}

{2014: Int64Index([0, 2, 4, 9], dtype='int64'),
 2015: Int64Index([1, 3, 5, 10], dtype='int64'),
 2016: Int64Index([6, 8], dtype='int64'),
 2017: Int64Index([7, 11], dtype='int64')}

In [41]:
grouped.indices # dict of groupnames and arrays of indices belonging to the group

{2014: array([0, 2, 4, 9], dtype=int64),
 2015: array([ 1,  3,  5, 10], dtype=int64),
 2016: array([6, 8], dtype=int64),
 2017: array([ 7, 11], dtype=int64)}

In [44]:
grouped.get_group(2014) # you have to call this method with the correct datatype

     Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701

In [46]:
grouped.all()

      Team  Rank  Points
Year
2014  True  True    True
2015  True  True    True
2016  True  True    True
2017  True  True    True

In [47]:
grouped.any()

      Team  Rank  Points
Year
2014  True  True    True
2015  True  True    True
2016  True  True    True
2017  True  True    True

In [52]:
grouped.count()

      Team  Rank  Points
Year
2014     4     4       4
2015     4     4       4
2016     2     2       2
2017     2     2       2

In [54]:
print(df)
grouped.cumcount() # zählt für jede Gruppe die Anzahl der Vorkommen hoch

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

0     0
1     0
2     1
3     1
4     2
5     2
6     0
7     0
8     1
9     3
10    3
11    1
dtype: int64

In [55]:
grouped.first()

        Team  Rank  Points
Year
2014  Riders     1     876
2015  Riders     2     789
2016   Kings     1     756
2017   Kings     1     788

In [57]:
grouped.head(2)

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
11  Riders     2  2017     690

In [58]:
grouped.last()

        Team  Rank  Points
Year
2014  Royals     4     701
2015  Royals     1     804
2016  Riders     2     694
2017  Riders     2     690

In [59]:
grouped.mean()

      Rank  Points
Year
2014   2.5  795.25
2015   2.5  769.50
2016   1.5  725.00
2017   1.5  739.00

In [61]:
grouped.ngroup() # statt des Gruppennamens (Year) erhält jede Gruppe eine Integer-ID, beginnend bei 0

0     0
1     1
2     0
3     1
4     0
5     1
6     2
7     3
8     2
9     0
10    1
11    3
dtype: int64

In [66]:
print(type(grouped.size()))
grouped.size

<class 'pandas.core.series.Series'>

In [38]:
for category, restricted_df in grouped:
    print(category)
    print(restricted_df)

2014
     Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701
2015
      Team  Rank  Year  Points
1   Riders     2  2015     789
3   Devils     3  2015     673
5    kings     4  2015     812
10  Royals     1  2015     804
2016
     Team  Rank  Year  Points
6   Kings     1  2016     756
8  Riders     2  2016     694
2017
      Team  Rank  Year  Points
7    Kings     1  2017     788
11  Riders     2  2017     690

In [68]:
gr = df.groupby(["Year","Team"])

In [69]:
gr.groups

{(2014, 'Devils'): Int64Index([2], dtype='int64'),
 (2014, 'Kings'): Int64Index([4], dtype='int64'),
 (2014, 'Riders'): Int64Index([0], dtype='int64'),
 (2014, 'Royals'): Int64Index([9], dtype='int64'),
 (2015, 'Devils'): Int64Index([3], dtype='int64'),
 (2015, 'Riders'): Int64Index([1], dtype='int64'),
 (2015, 'Royals'): Int64Index([10], dtype='int64'),
 (2015, 'kings'): Int64Index([5], dtype='int64'),
 (2016, 'Kings'): Int64Index([6], dtype='int64'),
 (2016, 'Riders'): Int64Index([8], dtype='int64'),
 (2017, 'Kings'): Int64Index([7], dtype='int64'),
 (2017, 'Riders'): Int64Index([11], dtype='int64')}

In [103]:
print(type(gr.count()),'\n')
print(gr.count().loc[2014],'\n')
print(gr.count().loc[2014,'Devils'],'\n')
print(gr.count().index,'\n')
print(gr.count().index.levels,'\n')
print(type(gr.count().index.levels))
print(len(gr.count().index.levels),'\n')
print(gr.count().index.levels[0])
print(gr.count().index.levels[1])

<class 'pandas.core.frame.DataFrame'>

        Rank  Points
Team
Devils     1       1
Kings      1       1
Riders     1       1
Royals     1       1

Rank      1
Points    1
Name: (2014, Devils), dtype: int64

MultiIndex(levels=[[2014, 2015, 2016, 2017], ['Devils', 'Kings', 'Riders', 'Royals', 'kings']],
           labels=[[0, 0, 0, 0, 1, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 3, 0, 2, 3, 4, 1, 2, 1, 2]],
           names=['Year', 'Team'])

[[2014, 2015, 2016, 2017], ['Devils', 'Kings', 'Riders', 'Royals', 'kings']]

<class 'pandas.core.indexes.frozen.FrozenList'>
2

Int64Index([2014, 2015, 2016, 2017], dtype='int64', name='Year')
Index(['Devils', 'Kings', 'Riders', 'Royals', 'kings'], dtype='object', name='Team')

In [106]:
grouped.cumsum()

    Rank  Points
0      1     876
1      2     789
2      3    1739
3      5    1462
4      6    2480
5      9    2274
6      1     756
7      1     788
8      3    1450
9     10    3181
10    10    3078
11     3    1478

In [134]:
for group in gr:
    print(group[0])
    print(group[1],'\n')

(2014, 'Devils')
     Team  Rank  Year  Points
2  Devils     2  2014     863

(2014, 'Kings')
    Team  Rank  Year  Points
4  Kings     3  2014     741

(2014, 'Riders')
     Team  Rank  Year  Points
0  Riders     1  2014     876

(2014, 'Royals')
     Team  Rank  Year  Points
9  Royals     4  2014     701

(2015, 'Devils')
     Team  Rank  Year  Points
3  Devils     3  2015     673

(2015, 'Riders')
     Team  Rank  Year  Points
1  Riders     2  2015     789

(2015, 'Royals')
      Team  Rank  Year  Points
10  Royals     1  2015     804

(2015, 'kings')
    Team  Rank  Year  Points
5  kings     4  2015     812

(2016, 'Kings')
    Team  Rank  Year  Points
6  Kings     1  2016     756

(2016, 'Riders')
     Team  Rank  Year  Points
8  Riders     2  2016     694

(2017, 'Kings')
    Team  Rank  Year  Points
7  Kings     1  2017     788

(2017, 'Riders')
      Team  Rank  Year  Points
11  Riders     2  2017     690

In [133]:
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [122]:
print(gr.sum(),'\n')
print(grouped.sum())

             Rank  Points
Year Team
2014 Devils     2     863
     Kings      3     741
     Riders     1     876
     Royals     4     701
2015 Devils     3     673
     Riders     2     789
     Royals     1     804
     kings      4     812
2016 Kings      1     756
     Riders     2     694
2017 Kings      1     788
     Riders     2     690

      Rank  Points
Year
2014    10    3181
2015    10    3078
2016     3    1450
2017     3    1478

In [129]:
joined = gr.sum().join(grouped.sum(),lsuffix="_01", rsuffix="_02")
joined

             Rank_01  Points_01  Rank_02  Points_02
Year Team
2014 Devils        2        863       10       3181
     Kings         3        741       10       3181
     Riders        1        876       10       3181
     Royals        4        701       10       3181
2015 Devils        3        673       10       3078
     Riders        2        789       10       3078
     Royals        1        804       10       3078
     kings         4        812       10       3078
2016 Kings         1        756        3       1450
     Riders        2        694        3       1450
2017 Kings         1        788        3       1478
     Riders        2        690        3       1478

In [132]:
100.00 * joined["Points_01"]/joined["Points_02"]

Year  Team
2014  Devils    27.129833
      Kings     23.294561
      Riders    27.538510
      Royals    22.037095
2015  Devils    21.864847
      Riders    25.633528
      Royals    26.120858
      kings     26.380767
2016  Kings     52.137931
      Riders    47.862069
2017  Kings     53.315291
      Riders    46.684709
dtype: float64